Revit 2027 API
CircleLightShape.EmitDiameter Property
 The emit diameter.
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double EmitDiameter { get; set; }
Public Property EmitDiameter As Double
	Get
	Set
public:
property double EmitDiameter {
	double get ();
	void set (double value);
}
member EmitDiameter : float with get, set
Property Value
Double
 The emit diameter as a numerical value in feet between 1.0e-9 and 30000.0
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The shape dimension is not valid because it is not between 1.0e-9 and 30000.0.
See Also
Reference
CircleLightShape Class
Autodesk.Revit.DB.Lighting Namespace